In [15]:
import pandas as pd
import numpy as np

In [16]:
lista = [['BRASIL','BRASIL','BRASIL','ARGENTINA','ARGENTINA','ARGENTINA'],[2017,2018,2019,2017,2018,2019]]

In [17]:
tuplas = zip(*lista)

In [18]:
tuplas = list(tuplas)

In [19]:
tuplas

[('BRASIL', 2017),
 ('BRASIL', 2018),
 ('BRASIL', 2019),
 ('ARGENTINA', 2017),
 ('ARGENTINA', 2018),
 ('ARGENTINA', 2019)]

In [20]:
multi = pd.MultiIndex.from_tuples(tuplas)

In [21]:
multi

MultiIndex([(   'BRASIL', 2017),
            (   'BRASIL', 2018),
            (   'BRASIL', 2019),
            ('ARGENTINA', 2017),
            ('ARGENTINA', 2018),
            ('ARGENTINA', 2019)],
           )

In [22]:
dataframe1 = pd.DataFrame(data = np.random.randn(6,2), index = multi, columns = ['EXP TRIGO', 'EXP ARROZ'])

In [23]:
dataframe1

                EXP TRIGO  EXP ARROZ
BRASIL    2017  -0.859589   0.597716
          2018   2.109525  -0.627526
          2019  -0.476279  -1.570374
ARGENTINA 2017   0.554088  -0.747962
          2018   0.467379  -0.372557
          2019   0.746529   0.636098

In [24]:
dataframe1.index.names = ['PAÍS', 'ANO']

In [25]:
dataframe1

                EXP TRIGO  EXP ARROZ
PAÍS      ANO
BRASIL    2017  -0.859589   0.597716
          2018   2.109525  -0.627526
          2019  -0.476279  -1.570374
ARGENTINA 2017   0.554088  -0.747962
          2018   0.467379  -0.372557
          2019   0.746529   0.636098

In [26]:
#Encontrar valores

In [27]:
dataframe1['EXP ARROZ']

PAÍS       ANO
BRASIL     2017    0.597716
           2018   -0.627526
           2019   -1.570374
ARGENTINA  2017   -0.747962
           2018   -0.372557
           2019    0.636098
Name: EXP ARROZ, dtype: float64

In [28]:
dataframe1.loc['BRASIL']

      EXP TRIGO  EXP ARROZ
ANO
2017  -0.859589   0.597716
2018   2.109525  -0.627526
2019  -0.476279  -1.570374

In [37]:
dataframe1.xs(2017, level = 1)

           EXP TRIGO  EXP ARROZ
PAÍS
BRASIL     -0.859589   0.597716
ARGENTINA   0.554088  -0.747962

In [38]:
dataframe1.xs(2017, level = 1)['EXP ARROZ']

PAÍS
BRASIL       0.597716
ARGENTINA   -0.747962
Name: EXP ARROZ, dtype: float64

In [39]:
dataframe1[:2]

             EXP TRIGO  EXP ARROZ
PAÍS   ANO
BRASIL 2017  -0.859589   0.597716
       2018   2.109525  -0.627526

In [40]:
dataframe1[:5]

                EXP TRIGO  EXP ARROZ
PAÍS      ANO
BRASIL    2017  -0.859589   0.597716
          2018   2.109525  -0.627526
          2019  -0.476279  -1.570374
ARGENTINA 2017   0.554088  -0.747962
          2018   0.467379  -0.372557

In [41]:
dataframe1[['EXP TRIGO', 'EXP ARROZ']]

                EXP TRIGO  EXP ARROZ
PAÍS      ANO
BRASIL    2017  -0.859589   0.597716
          2018   2.109525  -0.627526
          2019  -0.476279  -1.570374
ARGENTINA 2017   0.554088  -0.747962
          2018   0.467379  -0.372557
          2019   0.746529   0.636098

In [44]:
#Outra forma exibição do dataframe

In [45]:
dataframe1.unstack()

          EXP TRIGO                     EXP ARROZ
ANO            2017      2018      2019      2017      2018      2019
PAÍS
ARGENTINA  0.554088  0.467379  0.746529 -0.747962 -0.372557  0.636098
BRASIL    -0.859589  2.109525 -0.476279  0.597716 -0.627526 -1.570374

In [46]:
dataframe2 = dataframe1.unstack()

In [47]:
dataframe2

          EXP TRIGO                     EXP ARROZ
ANO            2017      2018      2019      2017      2018      2019
PAÍS
ARGENTINA  0.554088  0.467379  0.746529 -0.747962 -0.372557  0.636098
BRASIL    -0.859589  2.109525 -0.476279  0.597716 -0.627526 -1.570374

In [53]:
dataframe2.xs(2017, axis = 1, level = 1)

           EXP TRIGO  EXP ARROZ
PAÍS
ARGENTINA   0.554088  -0.747962
BRASIL     -0.859589   0.597716